
/*Написание программы с использованием getpid() и getppid()
В качестве примера использования системных вызовов getpid() и getppid() самостоятельно напишите программу, печатающую значения PID и PPID для текущего процесса. Запустите ее несколько раз подряд. Посмотрите, как меняется идентификатор текущего процесса. Объясните наблюдаемые изменения.
*/

#include <stdio.h>
#include <sys/types.h>
#include <unistd.h>

int main(){

printf("PID: %i \n", getpid());
printf("PPID: %i \n", getppid());

return 0;
}
