/*Написание, компиляция и запуск программы для чтения информации из файла
Измените программу из предыдущего раздела так, чтобы она читала записанную ранее в файл информацию и печатала ее на экране. Все лишние операторы желательно удалить.*/

#include <sys/types.h>
#include <fcntl.h>
#include <stdio.h>
#include <unistd.h>
#include <stdlib.h>

int main(){
    int fd; 
    size_t size;
   
   
    /* Попытаемся открыть файл с именем myfile в текущей директории
     только для операций вывода. Если файла не существует, попробуем
     его создать с правами доступа 0666, т. е. read-write для всех
     категорий пользователей */
    if((fd = open("file", O_WRONLY | O_CREAT, 0666)) < 0){
        /* Если файл открыть не удалось, печатаем об этом сообщение 
        и прекращаем работу */
        printf("Can\'t open file\n");
        exit(-1); 
    } 
    /* Пробуем записать в файл 14 байт из нашего массива, т.е. всю 
    строку "Hello, world!" вместе с признаком конца 
строки */
    /* Закрываем файл */
    if(close(fd) < 0){ 
        printf("Can\'t close file\n");
    }
    return 0; 
}

